weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_WIFI.c
/**
 ******************************************************************************
 * @file    STM32_WifiESP_WIFI.c
 * @author  manu
 * @version 1.2.0
 * @date    13 juin 2025
 * @brief   Implémentation des fonctions haut niveau WiFi pour ESP01
 ******************************************************************************
 */

#include "STM32_WifiESP_WIFI.h"
#include <string.h>
#include <stdio.h>

/* ========================== OUTILS FACTORISÉS ========================== */

/**
 * @brief  Copie une réponse dans un buffer utilisateur en protégeant contre le débordement.
 */
static ESP01_Status_t esp01_copy_resp(char *dst, size_t dst_size, const char *src)
{
    if (!dst || !src || dst_size == 0)
        return ESP01_INVALID_PARAM;
    size_t len = strlen(src);
    if (len >= dst_size)
        return ESP01_BUFFER_OVERFLOW;
    strncpy(dst, src, dst_size - 1);
    dst[dst_size - 1] = 0;
    return ESP01_OK;
}

/**
 * @brief  Envoie une commande AT et gère le buffer de réponse.
 */
static ESP01_Status_t esp01_send_at_with_resp(const char *cmd, const char *expected, int timeout_ms, char *resp, size_t resp_size)
{
    if (!cmd || !expected)
        return ESP01_INVALID_PARAM;
    return esp01_send_raw_command_dma(cmd, resp, resp_size, expected, timeout_ms);
}

/*
static void esp01_log_error(const char *prefix, ESP01_Status_t status)
{
    _esp_login(">>> [%s] Erreur : %s", prefix, esp01_get_error_string(status));
}
*/

/* ========================== FONCTIONS PRINCIPALES ========================== */

/* --- Modes WiFi --- */
ESP01_Status_t esp01_get_connection_status(void)
{
    char resp[ESP01_MAX_RESP_BUF];
    ESP01_Status_t st = esp01_send_at_with_resp("AT+CWJAP?", "OK", ESP01_TIMEOUT_SHORT, resp, sizeof(resp));
    ESP01_LOG_DEBUG("STATUS", "Réponse : %s", resp);

    if (st != ESP01_OK)
        ESP01_RETURN_ERROR("STATUS", ESP01_FAIL);

    if (strstr(resp, "+CWJAP:"))
    {
        ESP01_LOG_INFO("STATUS", "Motif trouvé : +CWJAP (connecté)");
        return ESP01_OK;
    }
    ESP01_LOG_WARN("STATUS", "Motif non trouvé : non connecté");
    return ESP01_WIFI_NOT_CONNECTED;
}

ESP01_Status_t esp01_get_wifi_mode(int *mode)
{
    VALIDATE_PARAM(mode, ESP01_INVALID_PARAM);
    char resp[ESP01_MAX_RESP_BUF];
    ESP01_Status_t st = esp01_send_at_with_resp("AT+CWMODE?", "OK", ESP01_TIMEOUT_SHORT, resp, sizeof(resp));
    if (st != ESP01_OK)
        ESP01_RETURN_ERROR("CWMODE", st);

    char *line = strstr(resp, "+CWMODE:");
    if (line)
    {
        int val = 0;
        if (sscanf(line, "+CWMODE:%d", &val) == 1)
        {
            *mode = val;
            ESP01_LOG_INFO("CWMODE", "Mode WiFi lu : %d", val);
            return ESP01_OK;
        }
    }
    ESP01_LOG_WARN("CWMODE", "Motif non trouvé dans : %s", resp);
    return ESP01_FAIL;
}

ESP01_Status_t esp01_set_wifi_mode(int mode)
{
    if (mode < ESP01_WIFI_MODE_STA || mode > ESP01_WIFI_MODE_STA_AP)
        return ESP01_INVALID_PARAM;
    char cmd[ESP01_MAX_CMD_BUF];
    snprintf(cmd, sizeof(cmd), "AT+CWMODE=%d", mode);
    char resp[ESP01_MAX_RESP_BUF];
    ESP01_Status_t st = esp01_send_at_with_resp(cmd, "OK", ESP01_TIMEOUT_SHORT, resp, sizeof(resp));
    if (st != ESP01_OK)
        ESP01_RETURN_ERROR("CWMODE", st);
    ESP01_LOG_INFO("CWMODE", "Mode WiFi défini : %d", mode);
    return st;
}

const char *esp01_wifi_mode_to_string(int mode)
{
    switch (mode)
    {
    case ESP01_WIFI_MODE_STA:
        return "STA";
    case ESP01_WIFI_MODE_AP:
        return "AP";
    case ESP01_WIFI_MODE_STA_AP:
        return "STA+AP";
    default:
        return "INCONNU";
    }
}

ESP01_Status_t esp01_get_tcp_status(char *out, size_t out_size)
{
    ESP01_LOG_INFO("CIPSTATUS", "=== Lecture statut TCP ===");
    if (!out || out_size == 0)
        return ESP01_INVALID_PARAM;
    char resp[ESP01_MAX_RESP_BUF] = {0};
    ESP01_Status_t st = esp01_send_raw_command_dma("AT+CIPSTATUS", resp, sizeof(resp), "OK", 2000);
    strncpy(out, resp, out_size - 1);
    out[out_size - 1] = '\0';
    ESP01_LOG_INFO("CIPSTATUS", ">>> Réponse :\n%s", resp);
    return (st == ESP01_OK) ? ESP01_OK : ESP01_FAIL;
}

/* --- Scan WiFi --- */
ESP01_Status_t esp01_scan_networks(esp01_network_t *networks, uint8_t max_networks, uint8_t *found_networks)
{
    VALIDATE_PARAM(networks && found_networks && max_networks > 0, ESP01_INVALID_PARAM);
    char resp[ESP01_LARGE_RESP_BUF];
    *found_networks = 0;
    ESP01_Status_t st = esp01_send_at_with_resp("AT+CWLAP", "OK", ESP01_TIMEOUT_LONG, resp, sizeof(resp));
    if (st != ESP01_OK)
        ESP01_RETURN_ERROR("CWLAP", st);

    char *line = strtok(resp, "\r\n");
    while (line && *found_networks < max_networks)
    {
        if (strncmp(line, "+CWLAP:", 7) == 0)
        {
            int ecn = 0, rssi = 0, channel = 0;
            char ssid[ESP01_MAX_SSID_BUF] = {0};
            char mac[ESP01_MAX_MAC_LEN] = {0};
            if (sscanf(line, "+CWLAP:(%d,\"%32[^\"]\",%d,\"%17[^\"]\",%d)", &ecn, ssid, &rssi, mac, &channel) >= 4)
            {
                size_t ssid_len = strlen(ssid);
                if (esp01_check_buffer_size(ssid_len, sizeof(networks[*found_networks].ssid) - 1) != ESP01_OK)
                    continue;
                strncpy(networks[*found_networks].ssid, ssid, ESP01_MAX_SSID_LEN);
                networks[*found_networks].ssid[ESP01_MAX_SSID_LEN] = 0;
                networks[*found_networks].rssi = rssi;
                snprintf(networks[*found_networks].encryption, sizeof(networks[*found_networks].encryption), "%d", ecn);
                (*found_networks)++;
            }
        }
        line = strtok(NULL, "\r\n");
    }
    ESP01_LOG_INFO("CWLAP", "Scan terminé : %d réseau(x) trouvé(s)", *found_networks);
    return ESP01_OK;
}

char *esp01_print_wifi_networks(char *out, size_t out_size)
{
    VALIDATE_PARAM(out && out_size > 0, NULL);
    esp01_network_t nets[ESP01_MAX_SCAN_NETWORKS];
    uint8_t found = 0;
    ESP01_Status_t st = esp01_scan_networks(nets, ESP01_MAX_SCAN_NETWORKS, &found);
    size_t pos = 0;
    pos += snprintf(out + pos, out_size - pos, "Scan WiFi : %s\n", esp01_get_error_string(st));
    for (uint8_t i = 0; i < found && pos < out_size - 1; i++)
    {
        pos += snprintf(out + pos, out_size - pos, "[%u] SSID:%s RSSI:%d ENC:%s\n",
                        i + 1, nets[i].ssid, nets[i].rssi, nets[i].encryption);
    }
    return out;
}

/* --- DHCP --- */
ESP01_Status_t esp01_set_dhcp(bool enable)
{
    char cmd[ESP01_MAX_CMD_BUF];
    snprintf(cmd, sizeof(cmd), "AT+CWDHCP=1,%d", enable ? 1 : 0);
    char resp[ESP01_MAX_RESP_BUF];
    ESP01_Status_t st = esp01_send_at_with_resp(cmd, "OK", ESP01_TIMEOUT_SHORT, resp, sizeof(resp));
    if (st != ESP01_OK)
        ESP01_RETURN_ERROR("CWDHCP", st);
    ESP01_LOG_INFO("CWDHCP", "DHCP %s", enable ? "activé" : "désactivé");
    return st;
}

ESP01_Status_t esp01_get_dhcp(bool *enabled)
{
    VALIDATE_PARAM(enabled, ESP01_INVALID_PARAM);
    char resp[ESP01_MAX_RESP_BUF];
    ESP01_Status_t st = esp01_send_at_with_resp("AT+CWDHCP?", "OK", ESP01_TIMEOUT_SHORT, resp, sizeof(resp));
    if (st != ESP01_OK)
        ESP01_RETURN_ERROR("CWDHCP?", st);

    int32_t dhcp_mode = 0;
    if (esp01_parse_int_after(resp, "+CWDHCP:", &dhcp_mode) == ESP01_OK)
    {
        *enabled = (dhcp_mode & 0x01) ? true : false;
        ESP01_LOG_INFO("CWDHCP?", "DHCP lu : %s", *enabled ? "activé" : "désactivé");
        return ESP01_OK;
    }

    ESP01_LOG_WARN("CWDHCP?", "Motif non trouvé dans : %s", resp);
    ESP01_RETURN_ERROR("CWDHCP?", ESP01_FAIL);
}

/* --- Connexion/Déconnexion WiFi --- */
ESP01_Status_t esp01_disconnect_wifi(void)
{
    char resp[ESP01_MAX_RESP_BUF];
    ESP01_Status_t st = esp01_send_at_with_resp("AT+CWQAP", "OK", ESP01_TIMEOUT_SHORT, resp, sizeof(resp));
    if (st != ESP01_OK)
        ESP01_RETURN_ERROR("CWQAP", st);
    ESP01_LOG_INFO("CWQAP", "Déconnexion WiFi réussie");
    return st;
}

ESP01_Status_t esp01_connect_wifi(const char *ssid, const char *password)
{
    VALIDATE_PARAM(ssid && password, ESP01_INVALID_PARAM);
    char cmd[ESP01_MAX_CMD_BUF];
    snprintf(cmd, sizeof(cmd), "AT+CWJAP=\"%s\",\"%s\"", ssid, password);
    char resp[ESP01_MAX_RESP_BUF];
    ESP01_Status_t st = esp01_send_raw_command_dma(cmd, resp, sizeof(resp), "OK", ESP01_TIMEOUT_LONG);

    if (st == ESP01_OK)
    {
        ESP01_LOG_INFO("CWJAP", "Connexion réussie");
        return ESP01_OK;
    }
    if (strstr(resp, "ERROR"))
    {
        ESP01_LOG_ERROR("CWJAP", "Connexion refusée : %s", resp);
        ESP01_RETURN_ERROR("CWJAP", ESP01_FAIL);
    }
    ESP01_LOG_ERROR("CWJAP", "Timeout ou réponse inattendue");
    ESP01_RETURN_ERROR("CWJAP", ESP01_TIMEOUT);
}

/* --- IP, MAC, Hostname --- */
ESP01_Status_t esp01_get_current_ip(char *ip, size_t ip_size)
{
    VALIDATE_PARAM(ip && ip_size > 0, ESP01_INVALID_PARAM);
    char resp[ESP01_MAX_RESP_BUF] = {0};
    ESP01_Status_t status = esp01_send_at_with_resp("AT+CIFSR", "OK", ESP01_TIMEOUT_SHORT, resp, sizeof(resp));
    if (status != ESP01_OK)
        ESP01_RETURN_ERROR("CIFSR", status);

    const char *patterns[] = {"+CIFSR:STAIP,\"", "STAIP,\"", "+CIFSR:APIP,\"", "APIP,\""};
    for (unsigned i = 0; i < sizeof(patterns) / sizeof(patterns[0]); ++i)
    {
        char tmp[ESP01_MAX_IP_LEN] = {0};
        if (esp01_extract_quoted_value(resp, patterns[i], tmp, sizeof(tmp)))
        {
            if (esp01_check_buffer_size(strlen(tmp), ip_size - 1) != ESP01_OK)
                return ESP01_BUFFER_OVERFLOW;
            strncpy(ip, tmp, ip_size - 1);
            ip[ip_size - 1] = 0;
            ESP01_LOG_INFO("CIFSR", "Motif trouvé : %s, IP : %s", patterns[i], ip);
            return ESP01_OK;
        }
    }
    ESP01_LOG_WARN("CIFSR", "Aucun motif IP trouvé dans : %s", resp);
    ip[0] = 0;
    return ESP01_FAIL;
}

ESP01_Status_t esp01_get_ip_config(char *ip, size_t ip_len, char *gw, size_t gw_len, char *mask, size_t mask_len)
{
    VALIDATE_PARAM(ip && ip_len > 0 && gw && gw_len > 0 && mask && mask_len > 0, ESP01_INVALID_PARAM);
    char resp[ESP01_MAX_RESP_BUF] = {0};
    ESP01_Status_t st = esp01_send_at_with_resp("AT+CIPSTA?", "OK", ESP01_TIMEOUT_SHORT, resp, sizeof(resp));
    if (st != ESP01_OK)
        ESP01_RETURN_ERROR("CIPSTA?", st);

    snprintf(ip, ip_len, "N/A");
    snprintf(gw, gw_len, "N/A");
    snprintf(mask, mask_len, "N/A");
    esp01_extract_quoted_value(resp, "+CIPSTA:ip:\"", ip, ip_len);
    esp01_extract_quoted_value(resp, "+CIPSTA:gateway:\"", gw, gw_len);
    esp01_extract_quoted_value(resp, "+CIPSTA:netmask:\"", mask, mask_len);
    ESP01_LOG_INFO("CIPSTA?", "IP: %s, GW: %s, MASK: %s", ip, gw, mask);
    return (ip[0] != 0 && strcmp(ip, "N/A") != 0) ? ESP01_OK : ESP01_FAIL;
}

ESP01_Status_t esp01_get_rssi(int *rssi)
{
    VALIDATE_PARAM(rssi, ESP01_INVALID_PARAM);
    char resp[ESP01_MAX_RESP_BUF];
    ESP01_Status_t st = esp01_send_at_with_resp("AT+CWJAP?", "OK", ESP01_TIMEOUT_SHORT, resp, sizeof(resp));
    if (st != ESP01_OK)
        ESP01_RETURN_ERROR("CWJAP?", st);

    char *line = strstr(resp, "+CWJAP:");
    if (line)
    {
        int virgule = 0;
        while (*line && virgule < 3)
        {
            if (*line == ',')
                virgule++;
            line++;
        }
        while (*line == ' ')
            line++;
        int rssi_val = 0;
        if (sscanf(line, "%d", &rssi_val) == 1)
        {
            *rssi = rssi_val;
            ESP01_LOG_INFO("CWJAP?", "Motif trouvé : +CWJAP, RSSI : %d", *rssi);
            return ESP01_OK;
        }
    }
    ESP01_LOG_WARN("CWJAP?", "RSSI non trouvé dans : %s", resp);
    return ESP01_FAIL;
}

ESP01_Status_t esp01_get_mac(char *mac_buf, size_t buf_len)
{
    VALIDATE_PARAM(mac_buf && buf_len > 0, ESP01_INVALID_PARAM);
    char resp[ESP01_MAX_RESP_BUF];
    ESP01_Status_t st = esp01_send_at_with_resp("AT+CIFSR", "OK", ESP01_TIMEOUT_SHORT, resp, sizeof(resp));
    if (st != ESP01_OK)
        ESP01_RETURN_ERROR("CIFSR", st);

    char tmp[ESP01_MAX_MAC_LEN] = {0};
    if (esp01_extract_quoted_value(resp, "STAMAC,\"", tmp, sizeof(tmp)))
    {
        if (esp01_check_buffer_size(strlen(tmp), buf_len - 1) != ESP01_OK)
            return ESP01_BUFFER_OVERFLOW;
        strncpy(mac_buf, tmp, buf_len - 1);
        mac_buf[buf_len - 1] = 0;
        ESP01_LOG_INFO("CIFSR", "Motif trouvé : STAMAC, MAC : %s", mac_buf);
        return ESP01_OK;
    }
    ESP01_LOG_WARN("CIFSR", "MAC non trouvée dans : %s", resp);
    return ESP01_FAIL;
}

ESP01_Status_t esp01_set_hostname(const char *hostname)
{
    VALIDATE_PARAM(hostname, ESP01_INVALID_PARAM);
    char cmd[ESP01_MAX_CMD_BUF];
    snprintf(cmd, sizeof(cmd), "AT+CWHOSTNAME=\"%s\"", hostname);
    char resp[ESP01_MAX_RESP_BUF];
    ESP01_Status_t st = esp01_send_at_with_resp(cmd, "OK", ESP01_TIMEOUT_SHORT, resp, sizeof(resp));
    if (st != ESP01_OK)
        ESP01_RETURN_ERROR("CWHOSTNAME", st);
    ESP01_LOG_INFO("CWHOSTNAME", "Hostname défini : %s", hostname);
    return st;
}

/* --- Fonctions de copie de réponse génériques --- */
#define ESP01_COPY_RESP_FUNC(name, at_cmd)                                                                  \
    ESP01_Status_t name(char *out, size_t out_size)                                                         \
    {                                                                                                       \
        VALIDATE_PARAM(out && out_size > 0, ESP01_INVALID_PARAM);                                           \
        char resp[ESP01_MAX_RESP_BUF] = {0};                                                                \
        ESP01_Status_t st = esp01_send_at_with_resp(at_cmd, "OK", ESP01_TIMEOUT_SHORT, resp, sizeof(resp)); \
        if (st != ESP01_OK)                                                                                 \
            return st;                                                                                      \
        return esp01_copy_resp(out, out_size, resp);                                                        \
    }

ESP01_COPY_RESP_FUNC(esp01_get_wifi_connection, "AT+CWJAP?")
ESP01_COPY_RESP_FUNC(esp01_get_dhcp_status, "AT+CWDHCP?")
ESP01_COPY_RESP_FUNC(esp01_get_ip_info, "AT+CIPSTA?")
ESP01_COPY_RESP_FUNC(esp01_get_hostname, "AT+CWHOSTNAME?")
ESP01_COPY_RESP_FUNC(esp01_get_ap_config, "AT+CWSAP?")
ESP01_COPY_RESP_FUNC(esp01_get_wifi_state, "AT+CWSTATE?")

/* --- TCP/IP & Réseau --- */
ESP01_Status_t esp01_ping(const char *host)
{
    VALIDATE_PARAM(host, ESP01_INVALID_PARAM);
    char cmd[ESP01_MAX_CMD_BUF], resp[ESP01_MAX_RESP_BUF];
    snprintf(cmd, sizeof(cmd), "AT+PING=\"%s\"", host);
    ESP01_Status_t st = esp01_send_at_with_resp(cmd, "OK", 5000, resp, sizeof(resp));
    ESP01_LOG_INFO("PING", "Réponse : %s", resp);
    return (st == ESP01_OK) ? ESP01_OK : ESP01_FAIL;
}

ESP01_Status_t esp01_open_connection(const char *type, const char *addr, int port)
{
    VALIDATE_PARAM(type && addr && port > 0, ESP01_INVALID_PARAM);
    char cmd[ESP01_MAX_CMD_BUF], resp[ESP01_MAX_RESP_BUF];
    snprintf(cmd, sizeof(cmd), "AT+CIPSTART=\"%s\",\"%s\",%d", type, addr, port);
    ESP01_Status_t st = esp01_send_at_with_resp(cmd, "OK", 10000, resp, sizeof(resp));
    ESP01_LOG_INFO("CIPSTART", "Réponse : %s", resp);
    return (st == ESP01_OK) ? ESP01_OK : ESP01_FAIL;
}

ESP01_Status_t esp01_get_multiple_connections(bool *enabled)
{
    VALIDATE_PARAM(enabled, ESP01_INVALID_PARAM);
    char resp[ESP01_MAX_RESP_BUF];
    ESP01_Status_t st = esp01_send_at_with_resp("AT+CIPMUX?", "OK", 1000, resp, sizeof(resp));
    if (st != ESP01_OK)
        ESP01_RETURN_ERROR("CIPMUX?", st);

