weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_WIFI.c
    if (esp01_parse_bool_after(resp, "+CIPMUX:", enabled) == ESP01_OK)
    {
        ESP01_LOG_INFO("CIPMUX", "Multi-connexion : %s", *enabled ? "ON" : "OFF");
        return ESP01_OK;
    }
    ESP01_LOG_WARN("CIPMUX?", "Motif non trouvé dans : %s", resp);
    return ESP01_FAIL;
}

/* --- Configuration avancée --- */
ESP01_Status_t esp01_connect_wifi_config(
    ESP01_WifiMode_t mode,
    const char *ssid,
    const char *password,
    bool use_dhcp,
    const char *ip,
    const char *gateway,
    const char *netmask)
{
    ESP01_Status_t status;
    char cmd[ESP01_MAX_RESP_BUF];
    char resp[ESP01_MAX_RESP_BUF];

    ESP01_LOG_INFO("WIFI", "=== Début configuration WiFi ===");

    ESP01_LOG_INFO("WIFI", "Définition du mode WiFi...");
    status = esp01_set_wifi_mode(mode);
    ESP01_LOG_INFO("WIFI", "Set mode : %s", esp01_get_error_string(status));
    if (status != ESP01_OK)
    {
        ESP01_LOG_ERROR("WIFI", "Erreur : esp01_set_wifi_mode");
        return status;
    }
    HAL_Delay(300);

    if (mode == ESP01_WIFI_MODE_AP)
    {
        ESP01_LOG_INFO("WIFI", "Configuration du point d'accès (AP)...");
        snprintf(cmd, sizeof(cmd), "AT+CWSAP=\"%s\",\"%s\",5,3", ssid, password);
        status = esp01_send_at_with_resp(cmd, "OK", 2000, resp, sizeof(resp));
        ESP01_LOG_INFO("WIFI", "Set AP : %s", esp01_get_error_string(status));
        if (status != ESP01_OK)
        {
            ESP01_LOG_ERROR("WIFI", "Erreur : Configuration AP");
            return status;
        }
        HAL_Delay(300);

        if (ip && strlen(ip) > 0)
        {
            ESP01_LOG_INFO("WIFI", "Configuration IP fixe AP...");
            snprintf(cmd, sizeof(cmd), "AT+CIPAP=\"%s\"", ip);
            status = esp01_send_at_with_resp(cmd, "OK", 2000, resp, sizeof(resp));
            ESP01_LOG_INFO("WIFI", "Set IP AP : %s", esp01_get_error_string(status));
            if (status != ESP01_OK)
            {
                ESP01_LOG_ERROR("WIFI", "Erreur : Configuration IP AP");
                return status;
            }
        }
    }

    if (use_dhcp)
    {
        if (mode == ESP01_WIFI_MODE_STA)
        {
            ESP01_LOG_INFO("WIFI", "Activation du DHCP STA...");
            status = esp01_send_at_with_resp("AT+CWDHCP=1,1", "OK", 2000, resp, sizeof(resp));
        }
        else if (mode == ESP01_WIFI_MODE_AP)
        {
            ESP01_LOG_INFO("WIFI", "Activation du DHCP AP...");
            status = esp01_send_at_with_resp("AT+CWDHCP=2,1", "OK", 2000, resp, sizeof(resp));
        }
        ESP01_LOG_INFO("WIFI", "Set DHCP : %s", esp01_get_error_string(status));
        if (status != ESP01_OK)
        {
            ESP01_LOG_ERROR("WIFI", "Erreur : Activation DHCP");
            return status;
        }
    }
    else if (ip && gateway && netmask && mode == ESP01_WIFI_MODE_STA)
    {
        ESP01_LOG_INFO("WIFI", "Déconnexion du WiFi (CWQAP)...");
        esp01_send_at_with_resp("AT+CWQAP", "OK", 2000, resp, sizeof(resp));

        ESP01_LOG_INFO("WIFI", "Désactivation du DHCP client...");
        status = esp01_send_at_with_resp("AT+CWDHCP=0,1", "OK", 2000, resp, sizeof(resp));
        ESP01_LOG_INFO("WIFI", "Set DHCP : %s", esp01_get_error_string(status));
        if (status != ESP01_OK)
        {
            ESP01_LOG_ERROR("WIFI", "Erreur : Désactivation DHCP");
            return status;
        }
        ESP01_LOG_INFO("WIFI", "Configuration IP statique...");
        snprintf(cmd, sizeof(cmd), "AT+CIPSTA=\"%s\",\"%s\",\"%s\"", ip, gateway, netmask);
        status = esp01_send_at_with_resp(cmd, "OK", 2000, resp, sizeof(resp));
        ESP01_LOG_INFO("WIFI", "Set IP statique : %s", esp01_get_error_string(status));
        if (status != ESP01_OK)
        {
            ESP01_LOG_ERROR("WIFI", "Erreur : Configuration IP statique");
            return status;
        }
    }

    if (mode == ESP01_WIFI_MODE_STA)
    {
        ESP01_LOG_INFO("WIFI", "Connexion au réseau WiFi...");
        status = esp01_connect_wifi(ssid, password);
        ESP01_LOG_INFO("WIFI", "Connexion WiFi : %s", esp01_get_error_string(status));
        if (status != ESP01_OK)
        {
            ESP01_LOG_ERROR("WIFI", "Erreur : Connexion WiFi (CWJAP)");
            return status;
        }
        HAL_Delay(300);
    }

    ESP01_LOG_INFO("WIFI", "Activation de l'affichage IP client dans +IPD (AT+CIPDINFO=1)...");
    status = esp01_send_at_with_resp("AT+CIPDINFO=1", "OK", 2000, resp, sizeof(resp));
    ESP01_LOG_INFO("WIFI", "Set CIPDINFO : %s", esp01_get_error_string(status));
    if (status != ESP01_OK)
    {
        ESP01_LOG_ERROR("WIFI", "Erreur : AT+CIPDINFO=1");
        return status;
    }

    ESP01_LOG_INFO("WIFI", "=== Configuration WiFi terminée ===");
    return ESP01_OK;
}

ESP01_Status_t esp01_set_ip(const char *ip, const char *gw, const char *mask)
{
    VALIDATE_PARAM(ip, ESP01_INVALID_PARAM);
    char cmd[ESP01_MAX_CMD_BUF];
    int needed = 0;
    if (gw && mask)
        needed = snprintf(cmd, sizeof(cmd), "AT+CIPSTA=\"%s\",\"%s\",\"%s\"", ip, gw, mask);
    else if (gw)
        needed = snprintf(cmd, sizeof(cmd), "AT+CIPSTA=\"%s\",\"%s\"", ip, gw);
    else
        needed = snprintf(cmd, sizeof(cmd), "AT+CIPSTA=\"%s\"", ip);

    if (esp01_check_buffer_size(needed, sizeof(cmd) - 1) != ESP01_OK)
        return ESP01_BUFFER_OVERFLOW;

    char resp[ESP01_MAX_RESP_BUF] = {0};
    return esp01_send_at_with_resp(cmd, "OK", ESP01_TIMEOUT_SHORT, resp, sizeof(resp));
}

/* --- Configuration Point d'Accès (AP) --- */
ESP01_Status_t esp01_start_ap_config(const char *ssid, const char *password, int channel, int encryption)
{
    char cmd[ESP01_MAX_CMD_BUF];
    char resp[ESP01_MAX_RESP_BUF] = {0};
    ESP01_Status_t status;

    VALIDATE_PARAM(ssid && ssid[0] != '\0' && strlen(ssid) <= ESP01_MAX_SSID_LEN, ESP01_INVALID_PARAM);
    if (encryption != 0)
        VALIDATE_PARAM(password && strlen(password) >= 8 && strlen(password) <= 64, ESP01_INVALID_PARAM);
    VALIDATE_PARAM(channel >= 1 && channel <= 13, ESP01_INVALID_PARAM);
    VALIDATE_PARAM(encryption == 0 || encryption == 2 || encryption == 3 || encryption == 4, ESP01_INVALID_PARAM);

    snprintf(cmd, sizeof(cmd), "AT+CWSAP=\"%s\",\"%s\",%d,%d", ssid, password ? password : "", channel, encryption);

    status = esp01_send_at_with_resp(cmd, "OK", ESP01_TIMEOUT_SHORT, resp, sizeof(resp));
    if (status != ESP01_OK)
        ESP01_RETURN_ERROR("CWSAP", status);

