weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_WIFI.c
    _esp_login(">>> [CWSAP] AP configuré : %s", ssid);
    return ESP01_OK;
}

/* ========================== FONCTIONS UTILITAIRES ========================== */

const char *esp01_encryption_to_string(const char *enc)
{
    if (!enc)
        return "INCONNU";
    if (strcmp(enc, "0") == 0)
        return "Open";
    if (strcmp(enc, "1") == 0)
        return "WEP";
    if (strcmp(enc, "2") == 0)
        return "WPA_PSK";
    if (strcmp(enc, "3") == 0)
        return "WPA2_PSK";
    if (strcmp(enc, "4") == 0)
        return "WPA_WPA2_PSK";
    return "INCONNU";
}

const char *esp01_tcp_status_to_string(const char *resp)
{
    static char buf[64];
    char *line = strstr(resp, "STATUS:");
    int code = -1;
    if (line && sscanf(line, "STATUS:%d", &code) == 1)
    {
        switch (code)
        {
        case 0:
            snprintf(buf, sizeof(buf), "IP initialisation (STATUS:0)");
            break;
        case 1:
            snprintf(buf, sizeof(buf), "Non connecté (STATUS:1)");
            break;
        case 2:
            snprintf(buf, sizeof(buf), "Connecté à un AP, pas de connexion TCP (STATUS:2)");
            break;
        case 3:
            snprintf(buf, sizeof(buf), "Connexion TCP ou UDP ouverte (STATUS:3)");
            break;
        case 4:
            snprintf(buf, sizeof(buf), "Connexion TCP ou UDP fermée (STATUS:4)");
            break;
        case 5:
            snprintf(buf, sizeof(buf), "En attente de fermeture (STATUS:5)");
            break;
        default:
            snprintf(buf, sizeof(buf), "Inconnu (STATUS:%d)", code);
            break;
        }
        return buf;
    }
    return "Réponse TCP/IP inattendue";
}

const char *esp01_cwstate_to_string(const char *resp)
{
    static char buf[64];
    char *line = strstr(resp, "+CWSTATE:");
    int code = -1;
    char ssid[ESP01_MAX_SSID_BUF] = {0};
    if (line)
    {
        if (sscanf(line, "+CWSTATE:%d,\"%[^\"]\"", &code, ssid) == 2)
            snprintf(buf, sizeof(buf), "Connecté (état %d) à SSID: %s", code, ssid);
        else if (sscanf(line, "+CWSTATE:%d", &code) == 1)
            snprintf(buf, sizeof(buf), "État WiFi : %d", code);
        else
            snprintf(buf, sizeof(buf), "Format CWSTATE inconnu");
        return buf;
    }
    return "Réponse CWSTATE inattendue";
}

const char *esp01_connection_status_to_string(const char *resp)
{
    static char buf[64];
    char *line = strstr(resp, "+CWJAP:");
    if (line)
    {
        char ssid[ESP01_MAX_SSID_BUF] = {0};
        if (sscanf(line, "+CWJAP:\"%[^\"]", ssid) == 1)
            snprintf(buf, sizeof(buf), "Connecté à %s", ssid);
        else
            snprintf(buf, sizeof(buf), "Connecté (SSID inconnu)");
        return buf;
    }
    return "Non connecté";
}

const char *esp01_rf_power_to_string(int rf_dbm)
{
    static char buf[ESP01_MAX_CMD_BUF];
    snprintf(buf, sizeof(buf), "%d dBm", rf_dbm);
    return buf;
}

const char *esp01_cwqap_to_string(const char *resp)
{
    if (strstr(resp, "WIFI DISCONNECT"))
        return "WIFI DISCONNECTED";
    if (strstr(resp, "OK"))
        return "OK";
    return "Déconnexion OK";
}

const char *esp01_wifi_connection_to_string(const char *resp)
{
    static char buf[ESP01_MAX_RESP_BUF];
    char ssid[ESP01_MAX_SSID_BUF] = {0};
    if (strstr(resp, "+CWJAP:"))
    {
        if (sscanf(resp, "+CWJAP:\"%[^\"]\"", ssid) == 1)
            snprintf(buf, sizeof(buf), "Connecté à : %s", ssid);
        else
            snprintf(buf, sizeof(buf), "Connecté (SSID inconnu)");
    }
    else if (strstr(resp, "No AP"))
    {
        snprintf(buf, sizeof(buf), "Non connecté à un AP");
    }
    else
    {
        snprintf(buf, sizeof(buf), "Statut WiFi inconnu");
    }
    return buf;
}

const char *esp01_dhcp_status_to_string(const char *resp)
{
    static char buf[ESP01_MAX_RESP_BUF];
    int mode = -1;
    if (sscanf(resp, "+CWDHCP:%d", &mode) == 1)
        snprintf(buf, sizeof(buf), "DHCP %s", (mode & 1) ? "activé" : "désactivé");
    else
        snprintf(buf, sizeof(buf), "Statut DHCP inconnu");
    return buf;
}

const char *esp01_ip_info_to_string(const char *resp)
{
    static char buf[ESP01_MAX_RESP_BUF];
    char ip[ESP01_SMALL_BUF_SIZE] = "N/A", gw[ESP01_SMALL_BUF_SIZE] = "N/A", mask[ESP01_SMALL_BUF_SIZE] = "N/A";
    esp01_extract_quoted_value(resp, "+CIPSTA:ip:\"", ip, sizeof(ip));
    esp01_extract_quoted_value(resp, "+CIPSTA:gateway:\"", gw, sizeof(gw));
    esp01_extract_quoted_value(resp, "+CIPSTA:netmask:\"", mask, sizeof(mask));
    snprintf(buf, sizeof(buf), "IP: %s, GW: %s, MASK: %s", ip, gw, mask);
    return buf;
}

const char *esp01_hostname_raw_to_string(const char *resp)
{
    static char buf[ESP01_MAX_RESP_BUF];
    char hostname[48] = "N/A";
    esp01_extract_quoted_value(resp, "+CWHOSTNAME:\"", hostname, sizeof(hostname));
    snprintf(buf, sizeof(buf), "Hostname: %s", hostname);
    return buf;
}

const char *esp01_ap_config_to_string(const char *resp)
{
    static char out[128];
    char ssid[33] = {0};
    char pwd[33] = {0};
    int channel = 0, enc = 0, maxconn = 0, hidden = 0;

    // Recherche du motif +CWSAP:"SSID","PWD",channel,enc,maxconn,hidden
    const char *start = strstr(resp, "+CWSAP:");
    if (start)
    {
        int n = sscanf(start, "+CWSAP:\"%32[^\"]\",\"%32[^\"]\",%d,%d,%d,%d",
                       ssid, pwd, &channel, &enc, &maxconn, &hidden);
        if (n >= 4)
        {
            snprintf(out, sizeof(out),
                     "SSID: %s, PWD: %s, CH: %d, Sécu: %s, MaxConn: %d, Hidden: %d",
                     ssid, pwd, channel,
                     (enc == 0) ? "Open" : (enc == 2) ? "WPA_PSK"
                                       : (enc == 3)   ? "WPA2_PSK"
                                       : (enc == 4)   ? "WPA_WPA2_PSK"
                                                      : "Inconnu",
                     maxconn, hidden);
            return out;
        }
    }
    return "Config AP inconnue";
}

/* --- dans la fonction de wrapper pour CWQAP... */
ESP01_Status_t esp01_disconnect_ap(void)
{
    char resp[ESP01_MAX_RESP_BUF];
    ESP01_Status_t st = esp01_send_at_with_resp("AT+CWQAP", "OK", ESP01_TIMEOUT_SHORT, resp, sizeof(resp));
    if (st == ESP01_OK)
    {
        ESP01_LOG_INFO("CWQAP", "Déconnexion AP réussie");
        return ESP01_OK;
    }

    if (strstr(resp, "ERROR"))
    {
        ESP01_LOG_ERROR("CWQAP", "Déconnexion refusée : %s", resp);
        ESP01_RETURN_ERROR("CWQAP", ESP01_FAIL);
    }

    ESP01_LOG_ERROR("CWQAP", "Timeout ou réponse inattendue");
    ESP01_RETURN_ERROR("CWQAP", ESP01_TIMEOUT);
}

const char *esp01_ping_result_to_string(const char *resp)
{
    static char result[ESP01_SMALL_BUF_SIZE];
    const char *line = strstr(resp, "+PING:");
    if (line)
    {
        int ms = 0;
        if (sscanf(line, "+PING:%d", &ms) == 1)
        {
            snprintf(result, sizeof(result), "%d ms", ms);
            return result;
        }
    }
    return "Ping échoué";
}

/* ========================== TESTS MODULE WIFI ========================== */

