weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_WIFI.c
void test_wifi_module_STA(const char *ssid, const char *password)
{
    ESP01_Status_t status;
    char buf[128], ip[ESP01_MAX_IP_LEN], mac[ESP01_MAX_MAC_LEN], hostname[ESP01_MAX_HOSTNAME_LEN];
    int mode = 0, rssi = 0;
    bool dhcp = false;
    uint8_t found = 0;
    esp01_network_t networks[ESP01_MAX_SCAN_NETWORKS];
    char resp[ESP01_MAX_RESP_BUF];
    HAL_Delay(1000);

    // 1. Mode WiFi
    ESP01_LOG_INFO("WIFI", "\n=== [CWMODE] Configuration du mode WiFi ===");
    status = esp01_set_wifi_mode(ESP01_WIFI_MODE_STA);
    ESP01_LOG_INFO("WIFI", ">>> [CWMODE] Set : %s\r\n", esp01_get_error_string(status));
    HAL_Delay(500);
    ESP01_LOG_INFO("WIFI", "\n=== [CWMODE] Lecture du mode WiFi ===");
    status = esp01_get_wifi_mode(&mode);
    ESP01_LOG_INFO("WIFI", ">>> [CWMODE] Get : %s (%d)\r\n", esp01_wifi_mode_to_string(mode), mode);
    HAL_Delay(1000);

    // 2. DHCP
    ESP01_LOG_INFO("WIFI", "\n=== [CWDHCP] Configuration du DHCP ===");
    status = esp01_set_dhcp(true);
    ESP01_LOG_INFO("WIFI", ">>> [CWDHCP] Set : %s\r\n", esp01_get_error_string(status));
    HAL_Delay(500);

    ESP01_LOG_INFO("WIFI", "\n=== [CWDHCP] Lecture du DHCP ===");
    status = esp01_get_dhcp(&dhcp);
    ESP01_LOG_INFO("WIFI", ">>> [CWDHCP] Get : %s\r\n", dhcp ? "Activé" : "Désactivé");
    HAL_Delay(1000);

    // 3. Hostname
    ESP01_LOG_INFO("WIFI", "\n=== [CWHOSTNAME] Configuration du hostname ===");
    status = esp01_set_hostname("ESP-TEST");
    ESP01_LOG_INFO("WIFI", ">>> [CWHOSTNAME] Set : %s", esp01_get_error_string(status));
    HAL_Delay(500);

    ESP01_LOG_INFO("WIFI", "\n=== [CWHOSTNAME] Lecture du hostname ===");
    status = esp01_get_hostname(hostname, sizeof(hostname));
    ESP01_LOG_INFO("WIFI", ">>> [CWHOSTNAME] Get : %s", hostname);
    HAL_Delay(1000);

    // 4. Scan réseaux
    ESP01_LOG_INFO("WIFI", "\n=== [CWLAP] Scan des réseaux ===");
    status = esp01_scan_networks(networks, ESP01_MAX_SCAN_NETWORKS, &found);
    ESP01_LOG_INFO("WIFI", ">>> [CWLAP] Scan : %s (%d trouvés)", esp01_get_error_string(status), found);
    if (status == ESP01_OK)
    {
        for (uint8_t i = 0; i < found; ++i)
            ESP01_LOG_INFO("WIFI", "    SSID: %s, RSSI: %d, Sécu: %s", networks[i].ssid, networks[i].rssi, esp01_encryption_to_string(networks[i].encryption));
    }
    HAL_Delay(1000);

    // 5. Connexion WiFi
    ESP01_LOG_INFO("WIFI", "\n=== [CWJAP] Connexion WiFi ===");
    status = esp01_connect_wifi(ssid, password);
    ESP01_LOG_INFO("WIFI", ">>> [CWJAP] Connexion : %s\r\n", esp01_get_error_string(status));
    HAL_Delay(1000);

    status = esp01_get_wifi_connection(resp, sizeof(resp));
    ESP01_LOG_INFO("WIFI", ">>> [CWJAP?] Statut : %s", (status == ESP01_OK) ? esp01_connection_status_to_string(resp) : esp01_get_error_string(status));
    HAL_Delay(1000);

    // 5b. Etat de la connexion WiFi (CWSTATE)
    ESP01_LOG_INFO("WIFI", "\n=== [CWSTATE] Etat de la connexion WiFi ===");
    status = esp01_get_wifi_state(resp, sizeof(resp));
    ESP01_LOG_INFO("WIFI", ">>> [CWSTATE] Etat : %s", (status == ESP01_OK) ? esp01_cwstate_to_string(resp) : esp01_get_error_string(status));
    HAL_Delay(1000);

    // 6. Adresse IP
    ESP01_LOG_INFO("WIFI", "\n=== [CIFSR] Adresse IP ===");
    status = esp01_get_current_ip(ip, sizeof(ip));
    ESP01_LOG_INFO("WIFI", ">>> [CIFSR] IP : %s", (status == ESP01_OK) ? ip : esp01_get_error_string(status));
    HAL_Delay(1000);

    // 7. Adresse MAC
    ESP01_LOG_INFO("WIFI", "\n=== [CIFSR] Adresse MAC ===");
    status = esp01_get_mac(mac, sizeof(mac));
    ESP01_LOG_INFO("WIFI", ">>> [CIFSR] MAC : %s", (status == ESP01_OK) ? mac : esp01_get_error_string(status));
    HAL_Delay(1000);

    // 8. RSSI
    ESP01_LOG_INFO("WIFI", "\n=== [CWJAP?] RSSI ===");
    status = esp01_get_rssi(&rssi);
    if (status == ESP01_OK)
        ESP01_LOG_INFO("WIFI", ">>> [CWJAP?] RSSI : %s", esp01_rf_power_to_string(rssi));
    else
        ESP01_LOG_INFO("WIFI", ">>> [CWJAP?] RSSI : %s", esp01_get_error_string(status));
    HAL_Delay(1000);

    // 9. Statut TCP/IP
    ESP01_LOG_INFO("WIFI", "\n=== [CIPSTATUS] Statut TCP/IP ===");
    status = esp01_get_tcp_status(buf, sizeof(buf));
    ESP01_LOG_INFO("WIFI", ">>> [CIPSTATUS] : %s", (status == ESP01_OK) ? esp01_tcp_status_to_string(buf) : esp01_get_error_string(status));
    HAL_Delay(1000);

    // 10. Ping
    ESP01_LOG_INFO("WIFI", "\n=== [PING] Test du ping ===");
    char ping_resp[ESP01_MAX_RESP_BUF] = {0};
    snprintf(buf, sizeof(buf), "AT+PING=\"8.8.8.8\"");
    status = esp01_send_raw_command_dma(buf, ping_resp, sizeof(ping_resp), "OK", 5000);
    ESP01_LOG_INFO("WIFI", ">>> [PING] : %s", esp01_ping_result_to_string(ping_resp));
    HAL_Delay(1000);

    // 11. Déconnexion WiFi
    ESP01_LOG_INFO("WIFI", "\n=== [CWQAP] Déconnexion WiFi ===");
    memset(resp, 0, sizeof(resp)); // Vide le buffer si besoin
    status = esp01_disconnect_wifi();
    ESP01_LOG_INFO("WIFI", ">>> [CWQAP] : %s", (status == ESP01_OK) ? esp01_cwqap_to_string(resp) : esp01_get_error_string(status));
    HAL_Delay(1000);
}

void test_wifi_module_AP(const char *ssid, const char *password)
{
    char resp[ESP01_MAX_RESP_BUF] = {0};
    ESP01_Status_t status;

    // === [CWMODE] Configuration du mode AP ===
    ESP01_LOG_INFO("WIFI", "\n=== [CWMODE] Configuration du mode WiFi (AP) ===");
    status = esp01_set_wifi_mode(2); // 2 = AP
    ESP01_LOG_INFO("WIFI", ">>> [CWMODE] Set : %s", esp01_get_error_string(status));

    // === [CWSAP] Configuration AP ===
    ESP01_LOG_INFO("WIFI", "\n=== [CWSAP] Configuration AP ===");
    status = esp01_start_ap_config(ssid, password, 1, 3);
    ESP01_LOG_INFO("WIFI", ">>> [CWSAP] Set : %s", esp01_get_error_string(status));

    // === [CWSAP?] Lecture de la config AP ===
    ESP01_LOG_INFO("WIFI", "\n=== [CWSAP?] Lecture de la config AP ===");
    status = esp01_get_ap_config(resp, sizeof(resp));
    ESP01_LOG_INFO("WIFI", ">>> [CWSAP?] : %s", (status == ESP01_OK) ? esp01_ap_config_to_string(resp) : esp01_get_error_string(status));
    HAL_Delay(10000);

    ESP01_LOG_INFO("WIFI", "\n=== [AP TEST] Fin du test AP ===");
}
